xlloss/ble_uart_bridge/nRF5_SDK_12.3.0_d7731ad/examples/ble_peripheral/ble_app_uart/main.c
/**@brief   Function for handling app_uart events.
 *
 * @details This function will receive a single character from the app_uart module and append it to
 *          a string. The string will be be sent over BLE when the last character received was a
 *          'new line' i.e '\r\n' (hex 0x0D) or if the string has reached a length of
 *          @ref NUS_MAX_DATA_LENGTH.
 */
/**@snippet [Handling the data received over UART] */
void uart_event_handle(app_uart_evt_t * p_event)
{
    static uint8_t data_array[BLE_NUS_MAX_DATA_LEN];
    static uint8_t index = 0;
    uint32_t       err_code;

    switch (p_event->evt_type)
    {
        case APP_UART_DATA_READY:
						NRF_LOG_INFO("\r\nAPP_UART_DATA_READY\r\n");
            UNUSED_VARIABLE(app_uart_get(&data_array[index]));
            index++;

            if ((data_array[index - 1] == '\n') || (index >= (BLE_NUS_MAX_DATA_LEN)))
            {
                err_code = ble_nus_string_send(&m_nus, data_array, index);
                if (err_code != NRF_ERROR_INVALID_STATE)
                {
                    APP_ERROR_CHECK(err_code);
                }

                index = 0;
            }
            break;

        case APP_UART_COMMUNICATION_ERROR:
            APP_ERROR_HANDLER(p_event->data.error_communication);
            break;

        case APP_UART_FIFO_ERROR:
            APP_ERROR_HANDLER(p_event->data.error_code);
            break;

        default:
            break;
    }
}
/**@snippet [Handling the data received over UART] */


/**@brief  Function for initializing the UART module.
 */
/**@snippet [UART Initialization] */
static void uart_init(void)
{
    uint32_t                     err_code;
    const app_uart_comm_params_t comm_params =
    {
        RX_PIN_NUMBER,
        TX_PIN_NUMBER,
        RTS_PIN_NUMBER,
        CTS_PIN_NUMBER,
        APP_UART_FLOW_CONTROL_DISABLED,
        false,
        UART_BAUDRATE_BAUDRATE_Baud115200
    };

    APP_UART_FIFO_INIT( &comm_params,
                       UART_RX_BUF_SIZE,
                       UART_TX_BUF_SIZE,
                       uart_event_handle,
                       APP_IRQ_PRIORITY_LOWEST,
                       err_code);
    APP_ERROR_CHECK(err_code);
}
/**@snippet [UART Initialization] */


/**@brief Function for initializing the Advertising functionality.
 */
static void advertising_init(void)
{
    uint32_t               err_code;
    ble_advdata_t          advdata;
    ble_advdata_t          scanrsp;
    ble_adv_modes_config_t options;

    // Build advertising data struct to pass into @ref ble_advertising_init.
    memset(&advdata, 0, sizeof(advdata));
    advdata.name_type          = BLE_ADVDATA_FULL_NAME;
    advdata.include_appearance = false;
    advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;

    memset(&scanrsp, 0, sizeof(scanrsp));
    scanrsp.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    scanrsp.uuids_complete.p_uuids  = m_adv_uuids;

    memset(&options, 0, sizeof(options));
    options.ble_adv_fast_enabled  = true;
    options.ble_adv_fast_interval = APP_ADV_INTERVAL;
    options.ble_adv_fast_timeout  = APP_ADV_TIMEOUT_IN_SECONDS;

    err_code = ble_advertising_init(&advdata, &scanrsp, &options, on_adv_evt, NULL);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    bsp_event_t startup_event;

    uint32_t err_code = bsp_init(BSP_INIT_LED | BSP_INIT_BUTTONS,
                                 APP_TIMER_TICKS(100, APP_TIMER_PRESCALER),
                                 bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for placing the application in low power state while waiting for events.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}




/**@brief Function for handling the Battery measurement timer timeout.
 *
 * @details This function will be called each time the battery level measurement timer expires.
 *
 * @param[in] p_context  Pointer used for passing some arbitrary information (context) from the
 *                       app_start_timer() call to the timeout handler.
 */
#define A_TEAM1 "$$$1aaaaaaaaaaaaaaa1"
#define A_TEAM2 "1bbbbbbbbbbbbbbbbbb1"
#define A_TEAM3 "1ccccccccccccccc1###"

#define B_TEAM1 "$$$2aaaaaaaaaaaaaaa2"
#define B_TEAM2 "2bbbbbbbbbbbbbbbbbb2"
#define B_TEAM3 "2ccccccccccccccc2###"

#define C_TEAM1 "$$$3aaaaaaaaaaaaaaa3"
#define C_TEAM2 "3bbbbbbbbbbbbbbbbbb3"
#define C_TEAM3 "3ccccccccccccccc3###"

#define D_TEAM1 "$$$4aaaaaaaaaaaaaaa4"
#define D_TEAM2 "4bbbbbbbbbbbbbbbbbb4"
#define D_TEAM3 "4ccccccccccccccc4###"

#define E_TEAM1 "$$$5aaaaaaaaaaaaaaa5"
#define E_TEAM2 "5bbbbbbbbbbbbbbbbbb5"
#define E_TEAM3 "5ccccccccccccccc5###"


#define TEST_TEAM1 D_TEAM1
#define TEST_TEAM2 D_TEAM2
#define TEST_TEAM3 D_TEAM3

static void ble_tx_timeout_handler(void * p_context)
{
	uint32_t str_len = STR_LEN;
  uint32_t data_len;
  static uint8_t count = 0;

  uint8_t data_array1[20] = {TEST_TEAM1};
  uint8_t data_array2[20] = {TEST_TEAM2};
  uint8_t data_array3[20] = {TEST_TEAM3};
  uint8_t i = 0, j = 0;
#ifdef NUS_TX_AUTO_SEND
	uint32_t err_code;
#endif

	UNUSED_PARAMETER(p_context);
	NRF_LOG_INFO("\r\nble_tx_timeout_handler\r\n");
  //app_timer_stop(m_ble_tx_timer_id);

//#ifdef NUS_TX_AUTO_SEND
// 
//  data_len = 20;
//  
  if (count == 0) {
//    for (i = 0; i < data_len; i = i + 1) {
//        //NRF_LOG_INFO("data_array1[%d] %c\r\n", i, data_array1[i]);
        err_code = ble_nus_string_send(&m_nus, &data_array1[0], str_len);
        if (err_code != NRF_ERROR_INVALID_STATE) {
            APP_ERROR_CHECK(err_code);
        }
//     }
     count++;
  } else if (count == 1) {
//    for (i = 0; i < data_len; i = i + 1) {
//        //NRF_LOG_INFO("data_array2[%d] %c\r\n", i, data_array2[i]);
        err_code = ble_nus_string_send(&m_nus, &data_array2[0], str_len);
        if (err_code != NRF_ERROR_INVALID_STATE) {
            APP_ERROR_CHECK(err_code);
        }
//    }
    count++;
  } else if (count == 2) {
//    for (i = 0; i < data_len; i = i + 1) {
      //NRF_LOG_INFO("data_array3[%d] %c\r\n", i, data_array3[i]);
      err_code = ble_nus_string_send(&m_nus, &data_array3[0], str_len);
      if (err_code != NRF_ERROR_INVALID_STATE) {
          APP_ERROR_CHECK(err_code);
      }
//    }
    count++;
  }
   
  if (count == 3)
      count = 0;

  //app_timer_start(m_ble_tx_timer_id, TIMER_BLE_TX_INTERVAL, NULL);
//#endif
//
//#ifdef UART_TX_AUTO_SEND
//  for (i = 0; i < str_len; i++) {
//		app_uart_put(data_array[i]);
//	}
//#endif

