xlloss/ble_uart_bridge/nRF5_SDK_12.3.0_d7731ad/examples/ble_peripheral/ble_app_uart/main.c
}

static void application_timers_start(void)
{
    uint32_t err_code;

    // Start application timers.
    err_code = app_timer_start(m_ble_tx_timer_id, TIMER_BLE_TX_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application timers.
 */
static void timers_init(void)
{
    uint32_t err_code;

    // Initialize timer module.
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);

    // Create timers.
    err_code = app_timer_create(&m_ble_tx_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                ble_tx_timeout_handler);
    APP_ERROR_CHECK(err_code);
}

/**@brief Application main function.
 */
int main(void)
{
    uint32_t err_code;
    bool erase_bonds;
    ret_code_t err_code_log;

    err_code_log = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code_log);

    // Initialize.
    timers_init();
//    uart_init();
//    buttons_leds_init(&erase_bonds);
    ble_stack_init();
    gap_params_init();
    services_init();
    advertising_init();
    conn_params_init();
    NRF_LOG_INFO("\r\nUART Start!\r\n");
//    printf("\r\nUART Start!\r\n");
    err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
#if 0
	application_timers_start();
#endif
    // Enter main loop.
    for (;;)
    {
        if (NRF_LOG_PROCESS() == false)
        {
			power_manage();
		}
    }
}


/**
 * @}
 */
